In [1]:
import pandas as pd

In [3]:
#creating dict to convert into dataframe
data = {'name': ['Harry', 'Larry', 'Tarry'], 'age': [18, 20, 15], 'address': ['Bhaktapur', 'Kathmandu', 'Pokhara']}
data

{'name': ['Harry', 'Larry', 'Tarry'],
 'age': [18, 20, 15],
 'address': ['Bhaktapur', 'Kathmandu', 'Pokhara']}

In [6]:
#converting dict into data frame
df = pd.DataFrame(data)
df

    name  age    address
0  Harry   18  Bhaktapur
1  Larry   20  Kathmandu
2  Tarry   15    Pokhara

In [35]:
#acessing elements from data frame using "dataframe.ix[]""
df.iloc[0, 0]

'Harry'

In [43]:
#creating new data frame from ecixting data frame
new_df = df.iloc[0:2, 0:3]
new_df

    name  age    address
0  Harry   18  Bhaktapur
1  Larry   20  Kathmandu

In [44]:
#determine unique element in dataframe
df['age'].unique()

array([18, 20, 15])

In [49]:
#crete new dataframe for people with age alteast 18yrs old
adult_df = df[df['age'] >= 18]
adult_df

    name  age    address
0  Harry   18  Bhaktapur
1  Larry   20  Kathmandu

In [50]:
#saving dataframe to csv file
adult_df.to_csv('data.csv')